---
kind: other
id: Methods.T:Autodesk.Revit.DB.TemporaryViewModes
source: html/0571747e-89c6-e0d3-29a5-78a231fe83f7.htm
---
# TemporaryViewModes Methods

Deactivates all temporary modes that are currently active.